Revit 2027 API
ParameterTypeId.FabricationPartAngleOption Property
 "Angle Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartAngleOption { get; }
Public Shared ReadOnly Property FabricationPartAngleOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartAngleOption {
	ForgeTypeId^ get ();
}
static member FabricationPartAngleOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace